In [3]:
import folium

ModuleNotFoundError: No module named 'folium'

In [2]:
! pip install folium

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001C450F4ECA0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/folium/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001C450F4ECD0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/folium/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001C450F54580>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/folium/
WARNING: Retrying (Retry(total=1, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001C450F540A0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/folium/
WARNING: Retrying (Retry(total=0, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001C450F54970>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/folium/
ERROR: Could not find a version that satisfies the requirement folium (from versions: none)
ERROR: No matching distribution found for folium

In [7]:
git clone https://github.com/python-visualization/folium.git
cd folium
python setup.py install

SyntaxError: invalid syntax (1309035743.py, line 1)

In [1]:
import folium

ModuleNotFoundError: No module named 'folium'

In [2]:
! pip3 install folium

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001ABAF56ECA0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/folium/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001ABAF56ECD0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/folium/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001ABAF574580>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/folium/
WARNING: Retrying (Retry(total=1, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001ABAF5740A0>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/folium/
WARNING: Retrying (Retry(total=0, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x000001ABAF574970>: Failed to establish a new connection: [Errno 11001] getaddrinfo failed')': /simple/folium/
ERROR: Could not find a version that satisfies the requirement folium (from versions: none)
ERROR: No matching distribution found for folium

In [4]:
! conda install branca
! conda install folium

Collecting package metadata (current_repodata.json): ...working... failed

CondaHTTPError: HTTP 000 CONNECTION FAILED for url <https://repo.anaconda.com/pkgs/main/win-64/current_repodata.json>
Elapsed: -

An HTTP error occurred when trying to retrieve this URL.
HTTP errors are often intermittent, and a simple retry will get you on your way.

If your current network has https://www.anaconda.com blocked, please file
a support request with your network engineering team.

'https://repo.anaconda.com/pkgs/main/win-64'

Collecting package metadata (current_repodata.json): ...working... failed

CondaHTTPError: HTTP 000 CONNECTION FAILED for url <https://repo.anaconda.com/pkgs/main/win-64/current_repodata.json>
Elapsed: -

An HTTP error occurred when trying to retrieve this URL.
HTTP errors are often intermittent, and a simple retry will get you on your way.

If your current network has https://www.anaconda.com blocked, please file
a support request with your network engineering team.

'https://repo.anaconda.com/pkgs/main/win-64'

In [5]:
! conda install -c conda-forge folium

Collecting package metadata (current_repodata.json): ...working... failed

CondaHTTPError: HTTP 000 CONNECTION FAILED for url <https://conda.anaconda.org/conda-forge/win-64/current_repodata.json>
Elapsed: -

An HTTP error occurred when trying to retrieve this URL.
HTTP errors are often intermittent, and a simple retry will get you on your way.
'https://conda.anaconda.org/conda-forge/win-64'

In [6]:
$ pip install folium

SyntaxError: invalid syntax (213675755.py, line 1)

In [7]:
import pandas

In [9]:
data=pandas.read_csv("volcanoes.txt")

In [10]:
data

,VOLCANX020,NUMBER,NAME,LOCATION,STATUS,ELEV,TYPE,TIMEFRAME,LAT,LON
0,509.0,1201-01=,Baker,US-Washington,Historical,3285.0,Stratovolcanoes,D3,48.776798,-121.810997
1,511.0,1201-02-,Glacier Peak,US-Washington,Tephrochronology,3213.0,Stratovolcano,D4,48.111801,-121.111000
2,513.0,1201-03-,Rainier,US-Washington,Dendrochronology,4392.0,Stratovolcano,D3,46.869801,-121.751000
3,515.0,1201-05-,St. Helens,US-Washington,Historical,2549.0,Stratovolcano,D1,46.199799,-122.181000
4,516.0,1201-04-,Adams,US-Washington,Tephrochronology,3742.0,Stratovolcano,D6,46.205799,-121.490997
...,...,...,...,...,...,...,...,...,...,...
57,580.0,1210-03-,Valles Caldera,US-New Mexico,Pleistocene-Fumarolic,3430.0,Caldera,Q,35.869999,-106.570999
58,581.0,1209-02-,Sunset Crater,US-Arizona,Dendrochronology,2447.0,Cinder cone,D6,35.369999,-111.501000
59,584.0,1203-20-,Amboy,US-California,Holocene,288.0,Cinder cone,U,34.549999,-115.780998
60,586.0,1210-02-,Zuni-Bandera,US-New Mexico,Anthropology,2550.0,Volcanic field,D7,34.799999,-108.001000
61,588.0,1210-01-,Carrizozo,US-New Mexico,Holocene,1731.0,Cinder cone,U,33.780102,-105.931000

# lec 11

## Numpy package

In [11]:
import numpy

In [14]:
my_list1=[10,20,30,40,50]

In [15]:
type(my_list1)

list

In [16]:
my_list1

[10, 20, 30, 40, 50]

In [18]:
numpy.array(my_list1)

array([10, 20, 30, 40, 50])

In [19]:
import numpy as np

In [20]:
arr1=np.array(my_list1)

In [21]:
arr1

array([10, 20, 30, 40, 50])

In [22]:
type(arr1)

numpy.ndarray

In [23]:
my_list2=[[10,20,30],[40,50,60],[70,80,90]]

In [24]:
my_list2

[[10, 20, 30], [40, 50, 60], [70, 80, 90]]

In [25]:
type(my_list2)

list

In [26]:
arr2=np.array(my_list2)

In [27]:
arr2

array([[10, 20, 30],
       [40, 50, 60],
       [70, 80, 90]])

In [28]:
type(arr2)

numpy.ndarray

In [29]:
## Arange()

In [30]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [31]:
list(range(5,25,2))

[5, 7, 9, 11, 13, 15, 17, 19, 21, 23]

In [32]:
arr3=np.arange(5,25,2)

In [33]:
arr3

array([ 5,  7,  9, 11, 13, 15, 17, 19, 21, 23])

In [34]:
type(arr3)

numpy.ndarray

In [36]:
np.arange(100,1000,100)

array([100, 200, 300, 400, 500, 600, 700, 800, 900])

In [37]:
np.zeros(10)

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [38]:
np.ones(10)

array([1., 1., 1., 1., 1., 1., 1., 1., 1., 1.])

In [40]:
np.zeros(10)+5

array([5., 5., 5., 5., 5., 5., 5., 5., 5., 5.])

In [41]:
np.ones(10)*5

array([5., 5., 5., 5., 5., 5., 5., 5., 5., 5.])

In [42]:
np.ones(20)*89

array([89., 89., 89., 89., 89., 89., 89., 89., 89., 89., 89., 89., 89.,
       89., 89., 89., 89., 89., 89., 89.])

In [45]:
np.zeros(20,dtype=int)+89

array([89, 89, 89, 89, 89, 89, 89, 89, 89, 89, 89, 89, 89, 89, 89, 89, 89,
       89, 89, 89])

In [46]:
np.linspace(0,10,3)

array([ 0.,  5., 10.])

In [47]:
np.linspace(0,10,5)

array([ 0. ,  2.5,  5. ,  7.5, 10. ])

In [48]:
np.linspace(0,10,10)

array([ 0.        ,  1.11111111,  2.22222222,  3.33333333,  4.44444444,
        5.55555556,  6.66666667,  7.77777778,  8.88888889, 10.        ])

In [50]:
np.eye(5)

array([[1., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0.],
       [0., 0., 1., 0., 0.],
       [0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 1.]])

In [51]:
np.eye(10)

array([[1., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 1.]])

In [52]:
###how to generate random no. with help of numpy

In [53]:
np.random.rand()

0.9515363589499144

In [54]:
np.random.rand()

0.37070395637481346

In [55]:
np.random.rand(10)

array([0.65300994, 0.24594781, 0.84955378, 0.38964529, 0.10723576,
       0.30841587, 0.09001006, 0.83981455, 0.03204692, 0.60813664])

In [57]:
np.random.rand(10)

array([0.603166  , 0.63848096, 0.13390582, 0.09375616, 0.16203799,
       0.23625158, 0.83010063, 0.51040229, 0.01651512, 0.70549812])

In [58]:
np.random.rand(3)

array([0.68039213, 0.02965939, 0.34434548])

In [60]:
np.random.randn()

-1.138230298880998

In [61]:
np.random.randn(5)

array([ 0.69064345,  0.01265273, -0.15492128,  1.12641787, -0.31651936])

In [62]:
np.random.randn(5,5) ##its 2d array

array([[-1.6269696 , -0.05493883, -0.51307549, -0.4916391 , -0.73449065],
       [-0.56132641, -0.49560814, -0.49155517,  0.57651739, -1.08969117],
       [-2.43524552,  0.24489753, -0.9328569 ,  0.20175789, -1.06611492],
       [-1.24920764,  1.20868748,  1.30786715,  0.13926138,  0.55276526],
       [ 0.44591227,  0.22585454,  0.35236953,  1.49930369,  0.63575105]])

In [63]:
np.random.randint(1)

0

In [64]:
np.random.randint(2)

1

In [65]:
np.random.randint(5)

3

In [69]:
arr=np.random.randint(5,20,5)

In [70]:
arr

array([16,  9, 12,  7, 16])

In [71]:
type(arr)

numpy.ndarray

In [72]:
arr=np.arange(25)

In [73]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
       17, 18, 19, 20, 21, 22, 23, 24])

In [74]:
arr2=np.random.randint(0,50,10)

In [75]:
arr2

array([39, 14, 19, 14, 39, 22, 44, 28, 30, 31])

In [76]:
arr.shape

(25,)

In [77]:
arr2.shape

(10,)

In [78]:
arr_2d=arr.reshape(5,5)

In [79]:
arr_2d

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [80]:
arr_2d.shape

(5, 5)

In [81]:
arr3=arr.reshape(4,5)

ValueError: cannot reshape array of size 25 into shape (4,5)

In [82]:
arr3=arr.reshape(25,1)

In [83]:
arr3

array([[ 0],
       [ 1],
       [ 2],
       [ 3],
       [ 4],
       [ 5],
       [ 6],
       [ 7],
       [ 8],
       [ 9],
       [10],
       [11],
       [12],
       [13],
       [14],
       [15],
       [16],
       [17],
       [18],
       [19],
       [20],
       [21],
       [22],
       [23],
       [24]])

In [84]:
arr3.shape

(25, 1)

In [85]:
arr4=arr.reshape(1,25)

In [86]:
arr4

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15,
        16, 17, 18, 19, 20, 21, 22, 23, 24]])

In [87]:
arr4.shape

(1, 25)

In [88]:
arr2

array([39, 14, 19, 14, 39, 22, 44, 28, 30, 31])

In [89]:
arr2.max()

44

In [90]:
arr2.min()

14

In [91]:
arr2.argmax()

6

In [92]:
arr2.argmin()

1

In [93]:
np.max(arr2)

44

In [94]:
np.min(arr2)

14

## numpy indexing

In [95]:
arr=np.arange(0,11)

In [96]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [97]:
arr[5]

5

In [98]:
arr[8]

8

In [99]:
arr[3:8]

array([3, 4, 5, 6, 7])

In [100]:
arr_slice=arr[3:8]

In [101]:
arr_slice

array([3, 4, 5, 6, 7])

In [102]:
arr

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [105]:
arr_slice[1:4]

array([4, 5, 6])

In [106]:
arr_slice[1:4]=78

In [107]:
arr_slice

array([ 3, 78, 78, 78,  7])

In [109]:
arr ##broadcasting

array([ 0,  1,  2,  3, 78, 78, 78,  7,  8,  9, 10])

In [110]:
arr=np.arange(0,11)

In [111]:
arr_copy=arr.copy()

In [112]:
arr_copy

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [113]:
arr2d=np.array(([5,10,15],[20,25,30],[35,40,45]))

In [115]:
arr2d

array([[ 5, 10, 15],
       [20, 25, 30],
       [35, 40, 45]])

In [116]:
arr2d[1,2]

30

In [117]:
arr2d

array([[ 5, 10, 15],
       [20, 25, 30],
       [35, 40, 45]])

In [118]:
arr2d[2]

array([35, 40, 45])

In [119]:
arr2d[2:,:]

array([[35, 40, 45]])

In [120]:
arr2d[2:]

array([[35, 40, 45]])

In [122]:
arr2d[2,1]

40

In [123]:
arr2d[1]

array([20, 25, 30])

In [124]:
arr2d[1:2]

array([[20, 25, 30]])

In [125]:
arr2d[1:2,:]

array([[20, 25, 30]])

In [126]:
arr2d[1:2,0:3]

array([[20, 25, 30]])

In [127]:
arr2d

array([[ 5, 10, 15],
       [20, 25, 30],
       [35, 40, 45]])

In [128]:
arr2d[:,1]

array([10, 25, 40])

In [129]:
arr2d[0:,1:2]

array([[10],
       [25],
       [40]])

In [130]:
arr2d[0:2,2:]

array([[15],
       [30]])

In [131]:
arr2d[:2,2:]

array([[15],
       [30]])

In [132]:
arr2d ##take 20 and 45

array([[ 5, 10, 15],
       [20, 25, 30],
       [35, 40, 45]])

In [148]:
arr2d[[1,2],[0,2]]

array([20, 45])

## session 12
### numpy day2

In [149]:
import numpy as np

In [152]:
arr=np.arange(1,26).reshape(5,5)

In [153]:
arr

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [154]:
type(arr)

numpy.ndarray

In [165]:
arr ## get 2,7,12 from this

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [159]:
arr[0,1],arr[1,1],arr[2,1]

(2, 7, 12)

In [161]:
arr[(0,1,2),(1,1,1)]

array([ 2,  7, 12])

In [162]:
arr[(0,1,2),(1)]

array([ 2,  7, 12])

In [166]:
arr[0:3,1:2]

array([[ 2],
       [ 7],
       [12]])

In [164]:
arr[0:3,1]

array([ 2,  7, 12])

In [167]:
arr

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [169]:
arr[2:5,1:5]

array([[12, 13, 14, 15],
       [17, 18, 19, 20],
       [22, 23, 24, 25]])

In [170]:
arr[2:5,1:]

array([[12, 13, 14, 15],
       [17, 18, 19, 20],
       [22, 23, 24, 25]])

In [171]:
arr[[1,3],[0,4]]

array([ 6, 20])

In [172]:
arr[(0,0,4,4),(3,4,3,4)]

array([ 4,  5, 24, 25])

In [173]:
arr[(0,0,4,4),(3,4,3,4)].reshape(2,2)

array([[ 4,  5],
       [24, 25]])

In [174]:
arr

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [175]:
arr.sum()

325

In [176]:
arr.std()

7.211102550927978

In [177]:
arr

array([[ 1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10],
       [11, 12, 13, 14, 15],
       [16, 17, 18, 19, 20],
       [21, 22, 23, 24, 25]])

In [178]:
arr.sum(axis=0) ##elements should be added in row viz

array([55, 60, 65, 70, 75])

In [179]:
arr.sum(axis=1)

array([ 15,  40,  65,  90, 115])

In [180]:
## fancy indexing

In [183]:
np.zeros(100)

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.])

In [184]:
np.zeros(100).reshape(10,10)

array([[0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.]])

In [186]:
arr2d=np.zeros((10,10))

In [187]:
arr2d

array([[0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 0.]])

In [188]:
arr2d.shape

(10, 10)

In [189]:
arr2d.shape[1]

10

In [192]:
arr_length=arr2d.shape[1]

In [193]:
arr_length

10

In [194]:
list(range(arr_length))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [195]:
for v in range(arr_length):
    arr2d[v]=v

In [196]:
arr2d

array([[0., 0., 0., 0., 0., 0., 0., 0., 0., 0.],
       [1., 1., 1., 1., 1., 1., 1., 1., 1., 1.],
       [2., 2., 2., 2., 2., 2., 2., 2., 2., 2.],
       [3., 3., 3., 3., 3., 3., 3., 3., 3., 3.],
       [4., 4., 4., 4., 4., 4., 4., 4., 4., 4.],
       [5., 5., 5., 5., 5., 5., 5., 5., 5., 5.],
       [6., 6., 6., 6., 6., 6., 6., 6., 6., 6.],
       [7., 7., 7., 7., 7., 7., 7., 7., 7., 7.],
       [8., 8., 8., 8., 8., 8., 8., 8., 8., 8.],
       [9., 9., 9., 9., 9., 9., 9., 9., 9., 9.]])

In [197]:
arr2d[[2,5,7,9]]

array([[2., 2., 2., 2., 2., 2., 2., 2., 2., 2.],
       [5., 5., 5., 5., 5., 5., 5., 5., 5., 5.],
       [7., 7., 7., 7., 7., 7., 7., 7., 7., 7.],
       [9., 9., 9., 9., 9., 9., 9., 9., 9., 9.]])

In [198]:
arr2d[[2,5,9,7]]

array([[2., 2., 2., 2., 2., 2., 2., 2., 2., 2.],
       [5., 5., 5., 5., 5., 5., 5., 5., 5., 5.],
       [9., 9., 9., 9., 9., 9., 9., 9., 9., 9.],
       [7., 7., 7., 7., 7., 7., 7., 7., 7., 7.]])

In [199]:
arr=np.arange(1,11)

In [200]:
arr

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [201]:
arr>6

array([False, False, False, False, False, False,  True,  True,  True,
        True])

In [202]:
arr[arr>6]

array([ 7,  8,  9, 10])

In [203]:
a=4
arr[arr>a]

array([ 5,  6,  7,  8,  9, 10])

In [204]:
arr=np.arange(0,10)

In [205]:
arr

array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])

In [206]:
arr+arr

array([ 0,  2,  4,  6,  8, 10, 12, 14, 16, 18])

In [207]:
arr*arr

array([ 0,  1,  4,  9, 16, 25, 36, 49, 64, 81])

In [208]:
arr/arr

C:\Users\GS-2219\AppData\Local\Temp\ipykernel_50900\1862401812.py:1: RuntimeWarning: invalid value encountered in true_divide
  arr/arr

array([nan,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.,  1.])

In [209]:
1/arr

C:\Users\GS-2219\AppData\Local\Temp\ipykernel_50900\255282349.py:1: RuntimeWarning: divide by zero encountered in true_divide
  1/arr

array([       inf, 1.        , 0.5       , 0.33333333, 0.25      ,
       0.2       , 0.16666667, 0.14285714, 0.125     , 0.11111111])

In [210]:
arr**3

array([  0,   1,   8,  27,  64, 125, 216, 343, 512, 729], dtype=int32)

In [211]:
np.sqrt(arr)

array([0.        , 1.        , 1.41421356, 1.73205081, 2.        ,
       2.23606798, 2.44948974, 2.64575131, 2.82842712, 3.        ])

In [212]:
np.sin(arr)

array([ 0.        ,  0.84147098,  0.90929743,  0.14112001, -0.7568025 ,
       -0.95892427, -0.2794155 ,  0.6569866 ,  0.98935825,  0.41211849])

In [213]:
np.log(arr)

C:\Users\GS-2219\AppData\Local\Temp\ipykernel_50900\3120950136.py:1: RuntimeWarning: divide by zero encountered in log
  np.log(arr)

array([      -inf, 0.        , 0.69314718, 1.09861229, 1.38629436,
       1.60943791, 1.79175947, 1.94591015, 2.07944154, 2.19722458])

In [216]:
np.arange(10,51)

array([10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
       27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43,
       44, 45, 46, 47, 48, 49, 50])

In [217]:
np.arange(0,9).reshape(3,3)

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [228]:
np.arange (0.01,1.01,0.01).reshape(10,10)

array([[0.01, 0.02, 0.03, 0.04, 0.05, 0.06, 0.07, 0.08, 0.09, 0.1 ],
       [0.11, 0.12, 0.13, 0.14, 0.15, 0.16, 0.17, 0.18, 0.19, 0.2 ],
       [0.21, 0.22, 0.23, 0.24, 0.25, 0.26, 0.27, 0.28, 0.29, 0.3 ],
       [0.31, 0.32, 0.33, 0.34, 0.35, 0.36, 0.37, 0.38, 0.39, 0.4 ],
       [0.41, 0.42, 0.43, 0.44, 0.45, 0.46, 0.47, 0.48, 0.49, 0.5 ],
       [0.51, 0.52, 0.53, 0.54, 0.55, 0.56, 0.57, 0.58, 0.59, 0.6 ],
       [0.61, 0.62, 0.63, 0.64, 0.65, 0.66, 0.67, 0.68, 0.69, 0.7 ],
       [0.71, 0.72, 0.73, 0.74, 0.75, 0.76, 0.77, 0.78, 0.79, 0.8 ],
       [0.81, 0.82, 0.83, 0.84, 0.85, 0.86, 0.87, 0.88, 0.89, 0.9 ],
       [0.91, 0.92, 0.93, 0.94, 0.95, 0.96, 0.97, 0.98, 0.99, 1.  ]])

In [230]:
np.linspace(0.01,1,100).reshape(10,10)

array([[0.01, 0.02, 0.03, 0.04, 0.05, 0.06, 0.07, 0.08, 0.09, 0.1 ],
       [0.11, 0.12, 0.13, 0.14, 0.15, 0.16, 0.17, 0.18, 0.19, 0.2 ],
       [0.21, 0.22, 0.23, 0.24, 0.25, 0.26, 0.27, 0.28, 0.29, 0.3 ],
       [0.31, 0.32, 0.33, 0.34, 0.35, 0.36, 0.37, 0.38, 0.39, 0.4 ],
       [0.41, 0.42, 0.43, 0.44, 0.45, 0.46, 0.47, 0.48, 0.49, 0.5 ],
       [0.51, 0.52, 0.53, 0.54, 0.55, 0.56, 0.57, 0.58, 0.59, 0.6 ],
       [0.61, 0.62, 0.63, 0.64, 0.65, 0.66, 0.67, 0.68, 0.69, 0.7 ],
       [0.71, 0.72, 0.73, 0.74, 0.75, 0.76, 0.77, 0.78, 0.79, 0.8 ],
       [0.81, 0.82, 0.83, 0.84, 0.85, 0.86, 0.87, 0.88, 0.89, 0.9 ],
       [0.91, 0.92, 0.93, 0.94, 0.95, 0.96, 0.97, 0.98, 0.99, 1.  ]])

In [233]:
np.arange(1,101).reshape(10,10)/100

array([[0.01, 0.02, 0.03, 0.04, 0.05, 0.06, 0.07, 0.08, 0.09, 0.1 ],
       [0.11, 0.12, 0.13, 0.14, 0.15, 0.16, 0.17, 0.18, 0.19, 0.2 ],
       [0.21, 0.22, 0.23, 0.24, 0.25, 0.26, 0.27, 0.28, 0.29, 0.3 ],
       [0.31, 0.32, 0.33, 0.34, 0.35, 0.36, 0.37, 0.38, 0.39, 0.4 ],
       [0.41, 0.42, 0.43, 0.44, 0.45, 0.46, 0.47, 0.48, 0.49, 0.5 ],
       [0.51, 0.52, 0.53, 0.54, 0.55, 0.56, 0.57, 0.58, 0.59, 0.6 ],
       [0.61, 0.62, 0.63, 0.64, 0.65, 0.66, 0.67, 0.68, 0.69, 0.7 ],
       [0.71, 0.72, 0.73, 0.74, 0.75, 0.76, 0.77, 0.78, 0.79, 0.8 ],
       [0.81, 0.82, 0.83, 0.84, 0.85, 0.86, 0.87, 0.88, 0.89, 0.9 ],
       [0.91, 0.92, 0.93, 0.94, 0.95, 0.96, 0.97, 0.98, 0.99, 1.  ]])

## pandas

In [234]:
import pandas as pd

In [235]:
### series

In [237]:
my_list1=[101,102,103,104,105]

In [238]:
my_list2=['x','y','z','p','q']

In [239]:
my_arr=np.array([1001,1002,1003,1004,1005])

In [240]:
my_dict={'a':300,'b':301,'c':302,'d':304,'e':305}

In [241]:
my_list1

[101, 102, 103, 104, 105]

In [243]:
my_list2

['x', 'y', 'z', 'p', 'q']

In [244]:
my_arr

array([1001, 1002, 1003, 1004, 1005])

In [245]:
my_dict

{'a': 300, 'b': 301, 'c': 302, 'd': 304, 'e': 305}

In [246]:
pd.Series(my_list2)

0    x
1    y
2    z
3    p
4    q
dtype: object

In [247]:
pd.Series(data=my_list2,index=my_list1)

101    x
102    y
103    z
104    p
105    q
dtype: object

In [248]:
type(pd.Series(data=my_list2,index=my_list1))

pandas.core.series.Series

In [250]:
pd.Series(index=my_list2,data=my_list1)

x    101
y    102
z    103
p    104
q    105
dtype: int64

In [251]:
pd.Series(my_arr,my_list2)

x    1001
y    1002
z    1003
p    1004
q    1005
dtype: int32

In [252]:
pd.Series(my_list2,my_arr)

1001    x
1002    y
1003    z
1004    p
1005    q
dtype: object

In [253]:
my_dict

{'a': 300, 'b': 301, 'c': 302, 'd': 304, 'e': 305}

In [254]:
pd.Series(my_dict)

a    300
b    301
c    302
d    304
e    305
dtype: int64

In [255]:
pd.Series(data=my_dict,index=my_list1)

101   NaN
102   NaN
103   NaN
104   NaN
105   NaN
dtype: float64

In [256]:
pd.Series(data=my_arr,index=my_dict)

a    1001
b    1002
c    1003
d    1004
e    1005
dtype: int32

## session 13

In [257]:
import pandas as pd

In [258]:
ser1=pd.Series([10,20,30,40],index=['Pune','Mumbai','Delhi','Banglore'])

In [259]:
ser2=pd.Series([10,20,30,40],index=['Pune','Mumbai','Chennai','Banglore'])

In [260]:
ser1

Pune        10
Mumbai      20
Delhi       30
Banglore    40
dtype: int64

In [261]:
ser2

Pune        10
Mumbai      20
Chennai     30
Banglore    40
dtype: int64

In [262]:
ser1+ser2

Banglore    80.0
Chennai      NaN
Delhi        NaN
Mumbai      40.0
Pune        20.0
dtype: float64

### dataframes

In [263]:
import numpy as np

In [264]:
np.random.randn(5,4)

array([[-0.64319886, -1.066889  , -1.00114394,  0.72572177],
       [-0.47847825,  0.28590296,  0.28546095,  0.61677225],
       [-0.44481202, -0.17016038,  0.07958696,  1.32296907],
       [ 0.16844417, -0.79829044,  0.50588373, -0.23763015],
       [-1.05759441,  1.22404319, -1.18922502, -0.96981512]])

In [266]:
my_df1=pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [267]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [268]:
type(my_df1)

pandas.core.frame.DataFrame

In [269]:
my_df1['Y']

A    0.379388
B    0.371593
C    1.257717
D    0.652366
E    0.057112
Name: Y, dtype: float64

In [270]:
type(my_df1['Y'])

pandas.core.series.Series

In [271]:
my_df1['Z']

A   -0.198146
B    0.590396
C    1.047816
D    1.594474
E    0.645937
Name: Z, dtype: float64

In [272]:
my_df1[['W','Y']]

          W         Y
A  0.170863  0.379388
B -0.851776  0.371593
C -1.660228  1.257717
D  0.435126  0.652366
E  0.221892  0.057112

In [273]:
type(my_df1[['W','Y']])

pandas.core.frame.DataFrame

In [274]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [275]:
my_df1.W

A    0.170863
B   -0.851776
C   -1.660228
D    0.435126
E    0.221892
Name: W, dtype: float64

In [276]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [277]:
my_df1['total of W and Y']=my_df1['W']+my_df1['Y']

In [278]:
my_df1

          W         X         Y         Z  total of W and Y
A  0.170863 -0.980644  0.379388 -0.198146          0.550251
B -0.851776 -1.241953  0.371593  0.590396         -0.480182
C -1.660228 -1.083074  1.257717  1.047816         -0.402511
D  0.435126 -0.715233  0.652366  1.594474          1.087492
E  0.221892  1.526366  0.057112  0.645937          0.279005

In [280]:
my_df1.drop('total of W and Y',axis=1)

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [281]:
my_df1

          W         X         Y         Z  total of W and Y
A  0.170863 -0.980644  0.379388 -0.198146          0.550251
B -0.851776 -1.241953  0.371593  0.590396         -0.480182
C -1.660228 -1.083074  1.257717  1.047816         -0.402511
D  0.435126 -0.715233  0.652366  1.594474          1.087492
E  0.221892  1.526366  0.057112  0.645937          0.279005

In [282]:
my_df1.drop('total of W and Y',axis=1,inplace=True)

In [283]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [284]:
my_df1.drop('D',axis=0)

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
E  0.221892  1.526366  0.057112  0.645937

In [285]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [286]:
my_df1.loc['D']

W    0.435126
X   -0.715233
Y    0.652366
Z    1.594474
Name: D, dtype: float64

In [287]:
my_df1.iloc[3]

W    0.435126
X   -0.715233
Y    0.652366
Z    1.594474
Name: D, dtype: float64

In [288]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [289]:
my_df1.loc['B','Y']

0.37159337813015714

In [290]:
my_df1.loc[['A','B'],['W','Y']]

          W         Y
A  0.170863  0.379388
B -0.851776  0.371593

In [291]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [292]:
my_df1>0

       W      X     Y      Z
A   True  False  True  False
B  False  False  True   True
C  False  False  True   True
D   True  False  True   True
E   True   True  True   True

In [293]:
 my_df1[my_df1>0]

          W         X         Y         Z
A  0.170863       NaN  0.379388       NaN
B       NaN       NaN  0.371593  0.590396
C       NaN       NaN  1.257717  1.047816
D  0.435126       NaN  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [294]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

A    True
B    True
C    True
D    True
E    True
Name: Y, dtype: bool

In [300]:
my_df1[my_df1['Y']>0]

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [298]:
my_df1[my_df1['Y']>0]['Z']

A   -0.198146
B    0.590396
C    1.047816
D    1.594474
E    0.645937
Name: Z, dtype: float64

In [299]:
my_df1['Y']>0

A    True
B    True
C    True
D    True
E    True
Name: Y, dtype: bool

In [301]:
my_df1[my_df1['Y']>0][['W','X']]

          W         X
A  0.170863 -0.980644
B -0.851776 -1.241953
C -1.660228 -1.083074
D  0.435126 -0.715233
E  0.221892  1.526366

In [302]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [303]:
my_df1['X']>0

A    False
B    False
C    False
D    False
E     True
Name: X, dtype: bool

In [305]:
my_df1['Y']>0

A    True
B    True
C    True
D    True
E    True
Name: Y, dtype: bool

In [306]:
(my_df1['X']>0) & (my_df1['Y']>0)

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [307]:
my_df1[(my_df1['X']>0) & (my_df1['Y']>0)]

          W         X         Y         Z
E  0.221892  1.526366  0.057112  0.645937

In [308]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [312]:
my_df1.reset_index()

  index         W         X         Y         Z
0     A  0.170863 -0.980644  0.379388 -0.198146
1     B -0.851776 -1.241953  0.371593  0.590396
2     C -1.660228 -1.083074  1.257717  1.047816
3     D  0.435126 -0.715233  0.652366  1.594474
4     E  0.221892  1.526366  0.057112  0.645937

In [313]:
my_df1

          W         X         Y         Z
A  0.170863 -0.980644  0.379388 -0.198146
B -0.851776 -1.241953  0.371593  0.590396
C -1.660228 -1.083074  1.257717  1.047816
D  0.435126 -0.715233  0.652366  1.594474
E  0.221892  1.526366  0.057112  0.645937

In [314]:
my_list1=['Pune','Mumbai','Banglore','Delhi','Chennai']

In [315]:
my_list1

['Pune', 'Mumbai', 'Banglore', 'Delhi', 'Chennai']

In [316]:
my_df1['cities']=my_list1

In [317]:
my_df1

          W         X         Y         Z    cities
A  0.170863 -0.980644  0.379388 -0.198146      Pune
B -0.851776 -1.241953  0.371593  0.590396    Mumbai
C -1.660228 -1.083074  1.257717  1.047816  Banglore
D  0.435126 -0.715233  0.652366  1.594474     Delhi
E  0.221892  1.526366  0.057112  0.645937   Chennai

In [318]:
my_df1.set_index('cities')

                 W         X         Y         Z
cities
Pune      0.170863 -0.980644  0.379388 -0.198146
Mumbai   -0.851776 -1.241953  0.371593  0.590396
Banglore -1.660228 -1.083074  1.257717  1.047816
Delhi     0.435126 -0.715233  0.652366  1.594474
Chennai   0.221892  1.526366  0.057112  0.645937

In [319]:
my_df1

          W         X         Y         Z    cities
A  0.170863 -0.980644  0.379388 -0.198146      Pune
B -0.851776 -1.241953  0.371593  0.590396    Mumbai
C -1.660228 -1.083074  1.257717  1.047816  Banglore
D  0.435126 -0.715233  0.652366  1.594474     Delhi
E  0.221892  1.526366  0.057112  0.645937   Chennai

In [320]:
my_df1.set_index('cities',inplace=True)

In [321]:
my_df1

                 W         X         Y         Z
cities
Pune      0.170863 -0.980644  0.379388 -0.198146
Mumbai   -0.851776 -1.241953  0.371593  0.590396
Banglore -1.660228 -1.083074  1.257717  1.047816
Delhi     0.435126 -0.715233  0.652366  1.594474
Chennai   0.221892  1.526366  0.057112  0.645937

In [322]:
my_df1.loc['Delhi']

W    0.435126
X   -0.715233
Y    0.652366
Z    1.594474
Name: Delhi, dtype: float64

In [323]:
s='hello everyone, we are learning,python'

In [324]:
s

'hello everyone, we are learning,python'

In [326]:
s.split()

['hello', 'everyone,', 'we', 'are', 'learning,python']

In [327]:
np.nan

nan

In [328]:
type(np.nan)

float

In [330]:
my_df1=pd.DataFrame({'A':[3,7,np.nan],
                   'B':[10,np.nan,np.nan],
                   'C':[12,9,5]}

SyntaxError: unexpected EOF while parsing (190144475.py, line 3)

In [331]:
my_df1=pd.DataFrame({'A':[3,7,np.nan],
                    'B':[10,np.nan,np.nan],
                    'C':[12,9,5]})

In [332]:
my_df1

     A     B   C
0  3.0  10.0  12
1  7.0   NaN   9
2  NaN   NaN   5

In [335]:
my_df1.dropna() ## it has drop the rows where is missing values

     A     B   C
0  3.0  10.0  12

In [334]:
my_df1

     A     B   C
0  3.0  10.0  12
1  7.0   NaN   9
2  NaN   NaN   5

In [336]:
my_df1.dropna(axis=0)

     A     B   C
0  3.0  10.0  12

In [337]:
my_df1.dropna(axis=1)

    C
0  12
1   9
2   5

In [338]:
my_df1

     A     B   C
0  3.0  10.0  12
1  7.0   NaN   9
2  NaN   NaN   5

In [339]:
my_df1.dropna(thresh=1)

     A     B   C
0  3.0  10.0  12
1  7.0   NaN   9
2  NaN   NaN   5

In [340]:
my_df1.dropna(thresh=2)

     A     B   C
0  3.0  10.0  12
1  7.0   NaN   9

In [341]:
my_df1.dropna(thresh=3)

     A     B   C
0  3.0  10.0  12

In [342]:
my_df1.dropna(thresh=4)

Empty DataFrame
Columns: [A, B, C]
Index: []

In [343]:
my_df1

     A     B   C
0  3.0  10.0  12
1  7.0   NaN   9
2  NaN   NaN   5

In [346]:
my_df1.fillna(value="Pune")

      A     B   C
0   3.0  10.0  12
1   7.0  Pune   9
2  Pune  Pune   5

In [347]:
my_df1['A']

0    3.0
1    7.0
2    NaN
Name: A, dtype: float64

In [348]:
my_df1['A'].mean()

5.0

In [349]:
my_df1.fillna(value=my_df1['A'].mean())

     A     B   C
0  3.0  10.0  12
1  7.0   5.0   9
2  5.0   5.0   5

In [350]:
my_df1['A'].fillna(value=my_df1['A'].mean())

0    3.0
1    7.0
2    5.0
Name: A, dtype: float64

## lec 14

In [7]:
data={'company':['google','google','microsoft','microsoft','facebook','facebook'],
     'employee':['sachin','ramesh','rahul','rohit','saurav','yuvi'],
     'sales':[200,400,112,289,345,230]}

In [2]:
data

{'company': ['google',
  'google',
  'microsoft',
  'microsoft',
  'facebook',
  'facebook'],
 'employee': ['sachin', 'ramesh', 'rahul', 'saurav', 'yuvi'],
 'sales': [200, 400, 112, 289, 345, 230]}

In [4]:
import pandas as pd

In [8]:
data

{'company': ['google',
  'google',
  'microsoft',
  'microsoft',
  'facebook',
  'facebook'],
 'employee': ['sachin', 'ramesh', 'rahul', 'rohit', 'saurav', 'yuvi'],
 'sales': [200, 400, 112, 289, 345, 230]}

In [9]:
my_def=pd.DataFrame(data)

In [10]:
my_def

     company employee  sales
0     google   sachin    200
1     google   ramesh    400
2  microsoft    rahul    112
3  microsoft    rohit    289
4   facebook   saurav    345
5   facebook     yuvi    230

In [12]:
by_comp=my_def.groupby('company')

In [13]:
by_comp.sum()

           sales
company
facebook     575
google       600
microsoft    401

In [14]:
by_comp.mean()

           sales
company
facebook   287.5
google     300.0
microsoft  200.5

In [15]:
by_comp.min()

          employee  sales
company
facebook    saurav    230
google      ramesh    200
microsoft    rahul    112

In [16]:
by_comp.max()

          employee  sales
company
facebook      yuvi    345
google      sachin    400
microsoft    rohit    289

In [17]:
by_comp.std()

                sales
company
facebook    81.317280
google     141.421356
microsoft  125.157900

In [18]:
by_comp.count()

           employee  sales
company
facebook          2      2
google            2      2
microsoft         2      2

In [19]:
by_comp.describe()

          sales
          count   mean         std    min     25%    50%     75%    max
company
facebook    2.0  287.5   81.317280  230.0  258.75  287.5  316.25  345.0
google      2.0  300.0  141.421356  200.0  250.00  300.0  350.00  400.0
microsoft   2.0  200.5  125.157900  112.0  156.25  200.5  244.75  289.0

In [21]:
my_def

     company employee  sales
0     google   sachin    200
1     google   ramesh    400
2  microsoft    rahul    112
3  microsoft    rohit    289
4   facebook   saurav    345
5   facebook     yuvi    230

In [22]:
my_def.describe().transpose()

       count        mean         std    min    25%    50%    75%    max
sales    6.0  262.666667  103.949347  112.0  207.5  259.5  331.0  400.0

In [23]:
by_comp.describe().transpose()

company       facebook      google  microsoft
sales count    2.00000    2.000000     2.0000
      mean   287.50000  300.000000   200.5000
      std     81.31728  141.421356   125.1579
      min    230.00000  200.000000   112.0000
      25%    258.75000  250.000000   156.2500
      50%    287.50000  300.000000   200.5000
      75%    316.25000  350.000000   244.7500
      max    345.00000  400.000000   289.0000

In [24]:
by_comp.describe().loc['google']

sales  count      2.000000
       mean     300.000000
       std      141.421356
       min      200.000000
       25%      250.000000
       50%      300.000000
       75%      350.000000
       max      400.000000
Name: google, dtype: float64

In [25]:
my_def2=pd.DataFrame({'col':[5,4,8,9],'col2':[55,78,55,90],'col3':['sachin','rahul','saurav','rohit']})

In [26]:
my_def2

   col  col2    col3
0    5    55  sachin
1    4    78   rahul
2    8    55  saurav
3    9    90   rohit

In [27]:
my_def2['col2']

0    55
1    78
2    55
3    90
Name: col2, dtype: int64

In [29]:
my_def2['col2'].unique()

array([55, 78, 90], dtype=int64)

In [30]:
my_def2['col2'].nunique()

3

In [32]:
my_def2['col2'].value_counts()

55    2
78    1
90    1
Name: col2, dtype: int64

In [33]:
def my_fun1(n):
    return n*n*n

In [34]:
my_fun1(6)

216

In [35]:
my_def2

   col  col2    col3
0    5    55  sachin
1    4    78   rahul
2    8    55  saurav
3    9    90   rohit

In [39]:
my_def2['col'].apply(my_fun1)

0    125
1     64
2    512
3    729
Name: col, dtype: int64

In [43]:
my_def2['col3']

0    sachin
1     rahul
2    saurav
3     rohit
Name: col3, dtype: object

In [ ]:
my_def2['col3'].apply(len)

In [45]:
my_def2['col2'].sum()

278

In [46]:
my_def2.shape

(4, 3)

In [47]:
my_def2.columns

Index(['col', 'col2', 'col3'], dtype='object')

In [48]:
my_def2.index

RangeIndex(start=0, stop=4, step=1)

In [49]:
del my_def2['col']

In [50]:
my_def2

   col2    col3
0    55  sachin
1    78   rahul
2    55  saurav
3    90   rohit

In [51]:
my_def2.sort_values(by='col2')

   col2    col3
0    55  sachin
2    55  saurav
1    78   rahul
3    90   rohit

In [53]:
my_def2.sort_values(by='col2',ascending=False)

   col2    col3
3    90   rohit
1    78   rahul
0    55  sachin
2    55  saurav

In [1]:
pwd

'C:\\Users\\GS-2219'

In [2]:
import pandas as pd

In [4]:
pd.read_csv('C:\\Users\\GS-2219\\Desktop\\AMIT\\pandas\\3Pandas-20220723T054408Z-001\\3Pandas.example')

FileNotFoundError: [Errno 2] No such file or directory: 'C:\\Users\\GS-2219\\Desktop\\AMIT\\pandas\\3Pandas-20220723T054408Z-001\\3Pandas.example'

In [6]:
pd.read_csv('C:\Users\GS-2219\Desktop\AMIT\pandas\3Pandas-20220723T054408Z-001\3Pandas.example')

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 2-3: truncated \UXXXXXXXX escape (2393082208.py, line 1)

In [9]:
file1_data=pd.read_csv('example')

In [10]:
file1_data

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
file1_data.to_csv('file1_data_exported',index=False)

In [13]:
file2=pd.read_excel('Excel_sample.xlsx',sheet_name='Sheet1')

In [14]:
file2

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [15]:
file2.shape

(4, 5)

In [18]:
file2.columns

Index(['Unnamed: 0', 'a', 'b', 'c', 'd'], dtype='object')

In [20]:
data3=pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [21]:
type(data3)

list

In [23]:
data3[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [24]:
type(data3[0])

pandas.core.frame.DataFrame

In [25]:
data3[0].to_excel("my_excel.xlsx",sheet_name='trail')